[
    {
        "title": "Path-Finding Algorithm",
        "description": "Pathfinding or pathing is the plotting, by a computer application, of the shortest route between two points. It is a more practical variant on solving mazes. Pathfinding is closely related to the shortest path problem, within graph theory, which examines how to identify the path that best meets some criteria (shortest, cheapest, fastest, etc) between two points in a large network. At its core, a pathfinding method searches a graph by starting at one vertex and exploring adjacent nodes until the destination node is reached, generally with the intent of finding the cheapest route.",
        "twoDlink": "/path-visual",
        "threeDlink": "https://simmer.io/@SmaxInfinity/death-room"
    },
    {
        "title": "Sorting Algorithm",
        "description": "A Sorting Algorithm is used to rearrange a given array or list elements according to a comparison operator on the elements. The comparison operator is used to decide the new order of element in the respective data structure. The most frequently used orders are numerical order and lexicographical order, and either ascending or descending. Efficient sorting is important for optimizing the efficiency of other algorithms (such as search and merge algorithms) that require input data to be in sorted lists. Sorting is also often useful for canonicalizing data and for producing human-readable output.",
        "twoDlink": "/sort-visual",
        "threeDlink": "https://simmer.io/@SmaxInfinity/death-room"
    },
    {
        "title": "Backtracking Algorithm",
        "description": "Backtracking is a general algorithm for finding solutions to some computational problems, notably constraint satisfaction problems, that incrementally builds candidates to the solutions, and abandons a candidate ('backtracks') as soon as it determines that the candidate cannot possibly be completed to a valid solution. Backtracking can be applied only for problems which admit the concept of a 'partial candidate solution' and a relatively quick test of whether it can possibly be completed to a valid solution. It is useless, for example, for locating a given value in an unordered table. When it is applicable, however, backtracking is often much faster than brute-force enumeration of all complete candidates, since it can eliminate many candidates with a single test.",
        "twoDlink": "/backtrack-visual",
        "threeDlink": "https://simmer.io/@SmaxInfinity/death-room"
    },
    {
        "title": "Dynamic Programming",
        "description": "Dynamic programming is both a mathematical optimization method and a computer programming method. The method was developed by Richard Bellman in the 1950s and has found applications in numerous fields, from aerospace engineering to economics. ",
        "twoDlink": "/path-visual",
        "threeDlink": "https://simmer.io/@SmaxInfinity/death-room"
    }
]